askn37/multix-zinnia-sdk-modernAVR/boards.txt
AVREB.bootloader.BODCFG=0b{bootloader.bod_lvl}{bootloader.bod_sample}{bootloader.bod_mode}00
AVREB.bootloader.BOOTSIZE=0x00
AVREB.bootloader.CODESIZE=0x00
AVREB.bootloader.OSCCFG=0b00000000
AVREB.bootloader.SYSCFG0=0b111{bootloader.updi_bit}{bootloader.reset_bit}{bootloader.browsave_bit}{bootloader.eesave_bit}
AVREB.bootloader.SYSCFG1=0b00000111
AVREB.bootloader.WDTCFG=0b00000000
AVREB.bootloader.bod_lvl=000
AVREB.bootloader.bod_mode=00
AVREB.bootloader.bod_sample=0
AVREB.bootloader.eepupload=
AVREB.bootloader.eesave_bit=1
AVREB.bootloader.browsave_bit=1
AVREB.bootloader.reset_bit=10
AVREB.bootloader.tool=avrdude
AVREB.bootloader.updi_bit=1
AVREB.bootloader.file=empty/empty.hex
AVREB.bootloader.programed_type=
AVREB.build.console_select=
AVREB.build.export_merged_output=false
AVREB.build.text_section_start=.text=0x0
AVREB.build.buildopt=-DNDEBUG
AVREB.build.console_baud=-DCONSOLE_BAUD=9600
AVREB.build.led_pin=-DLED_BUILTIN=PIN_PA7
AVREB.build.macroapi=-DENABLE_MACRO_API
AVREB.build.printf=
AVREB.build.printflt=
AVREB.upload.speed=115200
AVREB.upload.tool=
AVREB.menu.01_variant.24_AVR16EB32.build.board=AVR_AVR16EB32
AVREB.menu.01_variant.24_AVR16EB32.build.mcu=avr16eb32
AVREB.menu.01_variant.24_AVR16EB32.build.variant=avr_eb32
AVREB.menu.01_variant.24_AVR16EB32.compiler.c.elf.extra_flags=-Wl,-T{runtime.platform.path}/avrxmega3_p64.x
AVREB.menu.01_variant.24_AVR16EB32.upload.maximum_data_size=2048
AVREB.menu.01_variant.24_AVR16EB32.upload.maximum_size=16384
AVREB.menu.01_variant.24_AVR16EB32=32pin AVR16EB32 (16KiB+2KiB)
AVREB.menu.01_variant.30=-
AVREB.menu.01_variant.34_AVR16EB28.build.board=AVR_AVR16EB28
AVREB.menu.01_variant.34_AVR16EB28.build.mcu=avr16eb28
AVREB.menu.01_variant.34_AVR16EB28.build.variant=avr_eb28
AVREB.menu.01_variant.34_AVR16EB28.compiler.c.elf.extra_flags=-Wl,-T{runtime.platform.path}/avrxmega3_p64.x
AVREB.menu.01_variant.34_AVR16EB28.upload.maximum_data_size=2048
AVREB.menu.01_variant.34_AVR16EB28.upload.maximum_size=16384
AVREB.menu.01_variant.34_AVR16EB28=28pin AVR16EB28 (16KiB+2KiB)
AVREB.menu.01_variant.40=-
AVREB.menu.01_variant.44_AVR16EB20.build.board=AVR_AVR16EB20
AVREB.menu.01_variant.44_AVR16EB20.build.mcu=avr16eb20
AVREB.menu.01_variant.44_AVR16EB20.build.variant=avr_eb20
AVREB.menu.01_variant.44_AVR16EB20.compiler.c.elf.extra_flags=-Wl,-T{runtime.platform.path}/avrxmega3_p64.x
AVREB.menu.01_variant.44_AVR16EB20.upload.maximum_data_size=2048
AVREB.menu.01_variant.44_AVR16EB20.upload.maximum_size=16384
AVREB.menu.01_variant.44_AVR16EB20=20pin AVR16EB20 (16KiB+2KiB)
AVREB.menu.03_clock.01_20MHz.bootloader.bod_sample=0
AVREB.menu.03_clock.01_20MHz.build.f_cpu=20000000L
AVREB.menu.03_clock.01_20MHz=Internal 20 MHz
AVREB.menu.03_clock.02_10MHz.bootloader.bod_sample=0
AVREB.menu.03_clock.02_10MHz.build.f_cpu=10000000L
AVREB.menu.03_clock.02_10MHz=Internal 10 MHz
AVREB.menu.03_clock.03_5MHz.bootloader.bod_sample=0
AVREB.menu.03_clock.03_5MHz.build.f_cpu=5000000L
AVREB.menu.03_clock.03_5MHz=Internal 5 MHz
AVREB.menu.03_clock.10=-
AVREB.menu.03_clock.11_16MHz.bootloader.OSCCFG=0b11111111
AVREB.menu.03_clock.11_16MHz.bootloader.bod_sample=0
AVREB.menu.03_clock.11_16MHz.build.f_cpu=16000000L
AVREB.menu.03_clock.11_16MHz=Internal 16 MHz
AVREB.menu.03_clock.12_8MHz.bootloader.OSCCFG=0b11111111
AVREB.menu.03_clock.12_8MHz.bootloader.bod_sample=0
AVREB.menu.03_clock.12_8MHz.build.f_cpu=8000000L
AVREB.menu.03_clock.12_8MHz=Internal 8 MHz
AVREB.menu.03_clock.13_4MHz.bootloader.OSCCFG=0b11111111
AVREB.menu.03_clock.13_4MHz.bootloader.bod_sample=0
AVREB.menu.03_clock.13_4MHz.build.f_cpu=4000000L
AVREB.menu.03_clock.13_4MHz=Internal 4 MHz
AVREB.menu.03_clock.15_1MHz.bootloader.OSCCFG=0b11111111
AVREB.menu.03_clock.15_1MHz.bootloader.bod_sample=0
AVREB.menu.03_clock.15_1MHz.build.f_cpu=1000000L
AVREB.menu.03_clock.15_1MHz=Internal 1 MHz
AVREB.menu.03_clock.20=-
AVREB.menu.03_clock.21_2MHz.bootloader.bod_sample=0
AVREB.menu.03_clock.21_2MHz.build.f_cpu=2000000L
AVREB.menu.03_clock.21_2MHz=Internal 2 MHz
AVREB.menu.03_clock.22_32768Hz.bootloader.bod_sample=1
AVREB.menu.03_clock.22_32768Hz.build.f_cpu=32768
AVREB.menu.03_clock.22_32768Hz=Internal 32.768 kHz (ULP)
AVREB.menu.11_BODMODE.01_disabled.bootloader.bod_mode=00
AVREB.menu.11_BODMODE.01_disabled=BOD Disabled
AVREB.menu.11_BODMODE.02_enabled.bootloader.bod_mode=01
AVREB.menu.11_BODMODE.02_enabled=BOD Enabled
AVREB.menu.11_BODMODE.03_sampled.bootloader.bod_mode=10
AVREB.menu.11_BODMODE.03_sampled=BOD Sampled
AVREB.menu.11_BODMODE.04_enablewait.bootloader.bod_mode=11
AVREB.menu.11_BODMODE.04_enablewait=BOD Enabled hold wakeup
AVREB.menu.12_BODLVL.BODLEVEL0.bootloader.bod_lvl=000
AVREB.menu.12_BODLVL.BODLEVEL0=Level 1.75V (default)
AVREB.menu.12_BODLVL.BODLEVEL1.bootloader.bod_lvl=001
AVREB.menu.12_BODLVL.BODLEVEL1=Level 1.90V
AVREB.menu.12_BODLVL.BODLEVEL2.bootloader.bod_lvl=010
AVREB.menu.12_BODLVL.BODLEVEL2=Level 2.60V
AVREB.menu.12_BODLVL.BODLEVEL3.bootloader.bod_lvl=011
AVREB.menu.12_BODLVL.BODLEVEL3=Level 4.30V
AVREB.menu.21_resetpin.01_reset.bootloader.reset_bit=11
AVREB.menu.21_resetpin.01_reset=PF6 pin=Reset
AVREB.menu.21_resetpin.02_gpio.bootloader.reset_bit=01
AVREB.menu.21_resetpin.02_gpio=PF6 pin=GPIO (input only)
AVREB.menu.22_updipin.01_updi.bootloader.updi_bit=1
AVREB.menu.22_updipin.01_updi=PF7 pin=UPDI (default)
AVREB.menu.22_updipin.02_gpio.bootloader.updi_bit=0
AVREB.menu.22_updipin.02_gpio=PF7 pin=GPIO (DANGER:NOT RECOMMENDED)
AVREB.menu.23_eeprom.01_keep.bootloader.eesave_bit=1
AVREB.menu.23_eeprom.01_keep=Save guard "Retained"
AVREB.menu.23_eeprom.02_erase.bootloader.eesave_bit=0
AVREB.menu.23_eeprom.02_erase=Save guard "Erase"
AVREB.menu.23_eeprom.03_replace.bootloader.eepupload={bootloader.eeprom}
AVREB.menu.23_eeprom.03_replace.bootloader.eesave_bit=1
AVREB.menu.23_eeprom.03_replace="Erase" and "Replace"
AVREB.menu.25_bootrow.01_keep.bootloader.browsave_bit=1
AVREB.menu.25_bootrow.01_keep=Save guard "Retained"
AVREB.menu.25_bootrow.02_erase.bootloader.browsave_bit=0
AVREB.menu.25_bootrow.02_erase=Save guard "Erase"
AVREB.menu.51_buildopt.01_Release=Build Release (default)
AVREB.menu.51_buildopt.02_Debug1.build.buildopt=-DDEBUG=1
AVREB.menu.51_buildopt.02_Debug1=Build DEBUG=1
AVREB.menu.51_buildopt.03_Debug2.build.buildopt=-DDEBUG=2
AVREB.menu.51_buildopt.03_Debug2=Build DEBUG=2
AVREB.menu.52_macroapi.01_Enable=Macro API Enable (default)
AVREB.menu.52_macroapi.02_Disable.build.macroapi=
AVREB.menu.52_macroapi.02_Disable=Macro API Disable
AVREB.menu.52_macroapi.03_AllDisable.build.macroapi=
AVREB.menu.52_macroapi.03_AllDisable.compiler.ldflags=-nostartfiles -nostdlib
AVREB.menu.52_macroapi.03_AllDisable=Standard Library All Disable
AVREB.menu.53_printf.01_default=default
AVREB.menu.53_printf.02_full.build.printf=-DUSE_PRINTF_FLT
AVREB.menu.53_printf.02_full.build.printflt=-Wl,-u,vfprintf -lprintf_flt
AVREB.menu.53_printf.02_full=Float Support
AVREB.menu.90_console_baud.01_9600bps.build.console_baud=-DCONSOLE_BAUD=9600
AVREB.menu.90_console_baud.01_9600bps=CONSOLE_BAUD=9600 bps (default)
AVREB.menu.90_console_baud.03_38400bps.build.console_baud=-DCONSOLE_BAUD=38400
AVREB.menu.90_console_baud.03_38400bps=CONSOLE_BAUD=38400 bps
AVREB.menu.90_console_baud.04_57600bps.build.console_baud=-DCONSOLE_BAUD=57600
AVREB.menu.90_console_baud.04_57600bps=CONSOLE_BAUD=57600 bps
AVREB.menu.90_console_baud.05_115200bps.build.console_baud=-DCONSOLE_BAUD=115200
AVREB.menu.90_console_baud.05_115200bps=CONSOLE_BAUD=115200 bps
AVREB.menu.90_console_baud.06_230400bps.build.console_baud=-DCONSOLE_BAUD=230400
AVREB.menu.90_console_baud.06_230400bps=CONSOLE_BAUD=230400 bps
AVREB.menu.90_console_baud.15_1000000bps.build.console_baud=-DCONSOLE_BAUD=1000000
AVREB.menu.90_console_baud.15_1000000bps=CONSOLE_BAUD=1000000 bps
AVREB.menu.90_console_baud.20=-
AVREB.menu.90_console_baud.21_2400bps.build.console_baud=-DCONSOLE_BAUD=2400
AVREB.menu.90_console_baud.21_2400bps=CONSOLE_BAUD=2400 bps (for ULP)
AVREB.menu.95_bootloader.01_UART0_A0_LA7.bootloader.file=hex/boot_avreb_UART0_A0_{upload.speed}_LA7.hex
AVREB.menu.95_bootloader.01_UART0_A0_LA7.build.console_select=-DSerial=Serial0A
AVREB.menu.95_bootloader.01_UART0_A0_LA7=UART0 TX:PA0 RX:PA1 LED=PA7 (default)


AVREB14.bootloader.BODCFG=0b{bootloader.bod_lvl}{bootloader.bod_sample}{bootloader.bod_mode}00
AVREB14.bootloader.BOOTSIZE=0x00
AVREB14.bootloader.CODESIZE=0x00
AVREB14.bootloader.OSCCFG=0b00000000
AVREB14.bootloader.SYSCFG0=0b111{bootloader.updi_bit}{bootloader.reset_bit}{bootloader.browsave_bit}{bootloader.eesave_bit}
AVREB14.bootloader.SYSCFG1=0b00000111
AVREB14.bootloader.WDTCFG=0b00000000
AVREB14.bootloader.bod_lvl=000
AVREB14.bootloader.bod_mode=00
AVREB14.bootloader.bod_sample=0
AVREB14.bootloader.eepupload=
AVREB14.bootloader.eesave_bit=1
AVREB14.bootloader.browsave_bit=1
AVREB14.bootloader.reset_bit=10
AVREB14.bootloader.tool=avrdude
AVREB14.bootloader.updi_bit=1
AVREB14.bootloader.file=empty/empty.hex
AVREB14.bootloader.programed_type=
AVREB14.build.console_select=
AVREB14.build.export_merged_output=false
AVREB14.build.text_section_start=.text=0x0
AVREB14.build.buildopt=-DNDEBUG
AVREB14.build.console_baud=-DCONSOLE_BAUD=9600
AVREB14.build.led_pin=-DLED_BUILTIN=PIN_PA7
AVREB14.build.macroapi=-DENABLE_MACRO_API
AVREB14.build.printf=
AVREB14.build.printflt=
AVREB14.upload.speed=115200
AVREB14.upload.tool=
AVREB14.menu.01_variant.54_AVR16EB14.build.board=AVR_AVR16EB14
AVREB14.menu.01_variant.54_AVR16EB14.build.mcu=avr16eb14
AVREB14.menu.01_variant.54_AVR16EB14.build.variant=avr_eb14
AVREB14.menu.01_variant.54_AVR16EB14.compiler.c.elf.extra_flags=-Wl,-T{runtime.platform.path}/avrxmega3_p64.x
AVREB14.menu.01_variant.54_AVR16EB14.upload.maximum_data_size=2048
AVREB14.menu.01_variant.54_AVR16EB14.upload.maximum_size=16384
AVREB14.menu.01_variant.54_AVR16EB14=14pin AVR16EB14 (16KiB+2KiB)
AVREB14.menu.03_clock.01_20MHz.bootloader.bod_sample=0
AVREB14.menu.03_clock.01_20MHz.build.f_cpu=20000000L
AVREB14.menu.03_clock.01_20MHz=Internal 20 MHz
AVREB14.menu.03_clock.02_10MHz.bootloader.bod_sample=0
AVREB14.menu.03_clock.02_10MHz.build.f_cpu=10000000L
AVREB14.menu.03_clock.02_10MHz=Internal 10 MHz
AVREB14.menu.03_clock.03_5MHz.bootloader.bod_sample=0
AVREB14.menu.03_clock.03_5MHz.build.f_cpu=5000000L
AVREB14.menu.03_clock.03_5MHz=Internal 5 MHz
AVREB14.menu.03_clock.10=-
AVREB14.menu.03_clock.11_16MHz.bootloader.OSCCFG=0b11111111
AVREB14.menu.03_clock.11_16MHz.bootloader.bod_sample=0
AVREB14.menu.03_clock.11_16MHz.build.f_cpu=16000000L
AVREB14.menu.03_clock.11_16MHz=Internal 16 MHz
AVREB14.menu.03_clock.12_8MHz.bootloader.OSCCFG=0b11111111
AVREB14.menu.03_clock.12_8MHz.bootloader.bod_sample=0
AVREB14.menu.03_clock.12_8MHz.build.f_cpu=8000000L
AVREB14.menu.03_clock.12_8MHz=Internal 8 MHz
AVREB14.menu.03_clock.13_4MHz.bootloader.OSCCFG=0b11111111
AVREB14.menu.03_clock.13_4MHz.bootloader.bod_sample=0
AVREB14.menu.03_clock.13_4MHz.build.f_cpu=4000000L
AVREB14.menu.03_clock.13_4MHz=Internal 4 MHz
AVREB14.menu.03_clock.15_1MHz.bootloader.OSCCFG=0b11111111
AVREB14.menu.03_clock.15_1MHz.bootloader.bod_sample=0
AVREB14.menu.03_clock.15_1MHz.build.f_cpu=1000000L
AVREB14.menu.03_clock.15_1MHz=Internal 1 MHz
AVREB14.menu.03_clock.20=-
AVREB14.menu.03_clock.21_2MHz.bootloader.bod_sample=0
AVREB14.menu.03_clock.21_2MHz.build.f_cpu=2000000L
AVREB14.menu.03_clock.21_2MHz=Internal 2 MHz
AVREB14.menu.03_clock.22_32768Hz.bootloader.bod_sample=1
AVREB14.menu.03_clock.22_32768Hz.build.f_cpu=32768
AVREB14.menu.03_clock.22_32768Hz=Internal 32.768 kHz (ULP)
AVREB14.menu.11_BODMODE.01_disabled.bootloader.bod_mode=00
AVREB14.menu.11_BODMODE.01_disabled=BOD Disabled
AVREB14.menu.11_BODMODE.02_enabled.bootloader.bod_mode=01
AVREB14.menu.11_BODMODE.02_enabled=BOD Enabled
AVREB14.menu.11_BODMODE.03_sampled.bootloader.bod_mode=10
AVREB14.menu.11_BODMODE.03_sampled=BOD Sampled
AVREB14.menu.11_BODMODE.04_enablewait.bootloader.bod_mode=11
AVREB14.menu.11_BODMODE.04_enablewait=BOD Enabled hold wakeup
AVREB14.menu.12_BODLVL.BODLEVEL0.bootloader.bod_lvl=000
AVREB14.menu.12_BODLVL.BODLEVEL0=Level 1.75V (default)
AVREB14.menu.12_BODLVL.BODLEVEL1.bootloader.bod_lvl=001
AVREB14.menu.12_BODLVL.BODLEVEL1=Level 1.90V
AVREB14.menu.12_BODLVL.BODLEVEL2.bootloader.bod_lvl=010
AVREB14.menu.12_BODLVL.BODLEVEL2=Level 2.60V
AVREB14.menu.12_BODLVL.BODLEVEL3.bootloader.bod_lvl=011
AVREB14.menu.12_BODLVL.BODLEVEL3=Level 4.30V
AVREB14.menu.21_resetpin.01_reset.bootloader.reset_bit=11
AVREB14.menu.21_resetpin.01_reset=PF6 pin=Reset
AVREB14.menu.21_resetpin.02_gpio.bootloader.reset_bit=01
AVREB14.menu.21_resetpin.02_gpio=PF6 pin=GPIO (input only)
AVREB14.menu.22_updipin.01_updi.bootloader.updi_bit=1
AVREB14.menu.22_updipin.01_updi=PF7 pin=UPDI (default)
AVREB14.menu.22_updipin.02_gpio.bootloader.updi_bit=0
AVREB14.menu.22_updipin.02_gpio=PF7 pin=GPIO (DANGER:NOT RECOMMENDED)
AVREB14.menu.23_eeprom.01_keep.bootloader.eesave_bit=1
AVREB14.menu.23_eeprom.01_keep=Save guard "Retained"
AVREB14.menu.23_eeprom.02_erase.bootloader.eesave_bit=0
AVREB14.menu.23_eeprom.02_erase=Save guard "Erase"
AVREB14.menu.23_eeprom.03_replace.bootloader.eepupload={bootloader.eeprom}
AVREB14.menu.23_eeprom.03_replace.bootloader.eesave_bit=1
AVREB14.menu.23_eeprom.03_replace="Erase" and "Replace"
AVREB14.menu.25_bootrow.01_keep.bootloader.browsave_bit=1
AVREB14.menu.25_bootrow.01_keep=Save guard "Retained"
AVREB14.menu.25_bootrow.02_erase.bootloader.browsave_bit=0
AVREB14.menu.25_bootrow.02_erase=Save guard "Erase"
AVREB14.menu.51_buildopt.01_Release=Build Release (default)
AVREB14.menu.51_buildopt.02_Debug1.build.buildopt=-DDEBUG=1
AVREB14.menu.51_buildopt.02_Debug1=Build DEBUG=1
AVREB14.menu.51_buildopt.03_Debug2.build.buildopt=-DDEBUG=2
AVREB14.menu.51_buildopt.03_Debug2=Build DEBUG=2
AVREB14.menu.52_macroapi.01_Enable=Macro API Enable (default)
AVREB14.menu.52_macroapi.02_Disable.build.macroapi=
AVREB14.menu.52_macroapi.02_Disable=Macro API Disable
AVREB14.menu.52_macroapi.03_AllDisable.build.macroapi=
AVREB14.menu.52_macroapi.03_AllDisable.compiler.ldflags=-nostartfiles -nostdlib
AVREB14.menu.52_macroapi.03_AllDisable=Standard Library All Disable
AVREB14.menu.53_printf.01_default=default
AVREB14.menu.53_printf.02_full.build.printf=-DUSE_PRINTF_FLT
AVREB14.menu.53_printf.02_full.build.printflt=-Wl,-u,vfprintf -lprintf_flt
AVREB14.menu.53_printf.02_full=Float Support
AVREB14.menu.90_console_baud.01_9600bps.build.console_baud=-DCONSOLE_BAUD=9600
AVREB14.menu.90_console_baud.01_9600bps=CONSOLE_BAUD=9600 bps (default)
AVREB14.menu.90_console_baud.03_38400bps.build.console_baud=-DCONSOLE_BAUD=38400
AVREB14.menu.90_console_baud.03_38400bps=CONSOLE_BAUD=38400 bps
AVREB14.menu.90_console_baud.04_57600bps.build.console_baud=-DCONSOLE_BAUD=57600
AVREB14.menu.90_console_baud.04_57600bps=CONSOLE_BAUD=57600 bps
AVREB14.menu.90_console_baud.05_115200bps.build.console_baud=-DCONSOLE_BAUD=115200
AVREB14.menu.90_console_baud.05_115200bps=CONSOLE_BAUD=115200 bps
AVREB14.menu.90_console_baud.06_230400bps.build.console_baud=-DCONSOLE_BAUD=230400
AVREB14.menu.90_console_baud.06_230400bps=CONSOLE_BAUD=230400 bps
AVREB14.menu.90_console_baud.15_1000000bps.build.console_baud=-DCONSOLE_BAUD=1000000
AVREB14.menu.90_console_baud.15_1000000bps=CONSOLE_BAUD=1000000 bps
AVREB14.menu.90_console_baud.20=-
AVREB14.menu.90_console_baud.21_2400bps.build.console_baud=-DCONSOLE_BAUD=2400
AVREB14.menu.90_console_baud.21_2400bps=CONSOLE_BAUD=2400 bps (for ULP)
AVREB14.menu.95_bootloader.01_UART0_A0_LD7.bootloader.file=hex/boot_avreb_UART0_A0_{upload.speed}_LD7.hex
AVREB14.menu.95_bootloader.01_UART0_A0_LD7.build.console_select=-DSerial=Serial0A
AVREB14.menu.95_bootloader.01_UART0_A0_LD7=UART0 TX:PA0 RX:PA1 LED=PD7 (default)


